---
kind: other
id: Properties.T:Autodesk.Revit.Creation.FamilyItemFactory
source: html/be21c5e7-2407-c1bc-1a70-3f37ec23de3f.htm
---
# FamilyItemFactory Properties

Identifies if the object is read-only or modifiable.